In [1]:
import pandas as pd
import numpy as np

In [3]:
# 다중 인덱스와 인구 데이터로 Series 생성
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]

population = [33871648, 37253956,
             18976457, 19378102,
             20851820, 25145561]

pop = pd.Series(population, index=index)  # MultiIndex Series 생성
pop  # Series 출력

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [4]:
# ('California', 2010)부터 ('Texas', 2000)까지 슬라이싱
pop[('California', 2010):('Texas', 2000)]  # 주와 연도를 튜플로 지정하여 범위 추출

(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
dtype: int64

In [5]:
# 2010년 데이터의 인덱스만 추출
[i for i in pop.index if i[1] == 2010]  # i[1]은 연도를 나타냄

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

In [6]:
# 튜플로 구성된 리스트를 MultiIndex로 변환
index = pd.MultiIndex.from_tuples(index)  # index 리스트로부터 MultiIndex 생성
index  # MultiIndex 출력

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [7]:
# MultiIndex를 사용하여 Series 재정렬
pop = pop.reindex(index)  # 새로운 MultiIndex로 Series 재정렬
pop  # 재정렬된 Series 출력

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [8]:
pop[:, 2010]  # 모든 주(:)의 2010년 데이터 선택

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [9]:
pop.df = pop.unstack()  # Series를 DataFrame으로 변환 (행: 주, 열: 연도)
pop.df  # 변환된 DataFrame 출력

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [10]:
pop.df.stack()  # DataFrame을 MultiIndex Series로 변환

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [11]:
# 전체 인구와 18세 미만 인구로 DataFrame 생성
pop_df = pd.DataFrame({
    'total': pop,                    # 전체 인구 데이터 (기존 pop Series)
    'under18': [9267089, 9284094,   # 18세 미만 인구 데이터
                4687374, 4318033,
                5906301, 6879014]
})

pop_df  # DataFrame 출력

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [12]:
f_u18 = pop_df['under18'] / pop_df['total']
f_u18.unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

In [13]:
# 랜덤 데이터로 MultiIndex DataFrame 생성
df = pd.DataFrame(np.random.rand(4, 2),                # 4x2 랜덤 데이터
                 index=[['a', 'a', 'b', 'b'],         # 첫 번째 레벨 인덱스
                        [1, 2, 1, 2]],                # 두 번째 레벨 인덱스
                 columns=['data1', 'data2'])          # 열 이름

df  # DataFrame 출력

        data1     data2
a 1  0.778936  0.866307
  2  0.622827  0.331708
b 1  0.220380  0.931824
  2  0.836070  0.148195

In [14]:
# 튜플 키를 가진 딕셔너리로 Series 생성
data = {('California', 2000): 33871648,
        ('California', 2010): 37253956,
        ('Texas', 2000): 20851820,
        ('Texas', 2010): 25145561,
        ('New York', 2000): 18976457,
        ('New York', 2010): 19378102}

pd.Series(data)  # 딕셔너리를 Series로 변환

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

In [15]:
pd.MultiIndex.from_arrays([
    ['a', 'a', 'b', 'b'],  # 첫 번째 레벨
    [1, 2, 1, 2]           # 두 번째 레벨
])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [16]:
pd.MultiIndex.from_tuples([
    ('a', 1),  # 첫 번째 튜플 (상위: 'a', 하위: 1)
    ('a', 2),  # 두 번째 튜플 (상위: 'a', 하위: 2)
    ('b', 1),  # 세 번째 튜플 (상위: 'b', 하위: 1)
    ('b', 2)   # 네 번째 튜플 (상위: 'b', 하위: 2)
])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [18]:
pd.MultiIndex.from_product([['a', 'b'], [1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [22]:
# 현재 버전에 맞는 올바른 코드
pd.MultiIndex(
    levels=[['a', 'b'],   # 첫 번째 레벨의 고유값
            [1, 2]],      # 두 번째 레벨의 고유값
    codes=[[0, 0, 1, 1],  # labels 대신 codes 사용
           [0, 1, 0, 1]]  # 두 번째 레벨의 인덱스
)

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [23]:
pop.index.names = ['state', 'year']

pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [25]:
# 계층적 인덱스와 열
## 행 인덱스 생성 (연도, 방문 횟수)
index = pd.MultiIndex.from_product([[2014, 2014], [1, 2]],
                                 names=['year', 'visit'])

## 열 인덱스 생성 (대상자, 측정 유형)
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                   names=['subject', 'type'])

# 가상 데이터 생성
data = np.round(np.random.randn(4, 6), 1)  # 4x6 랜덤 데이터
data[:, ::2] *= 10  # HR 데이터 스케일 조정
data += 37  # 기준값 더하기

# MultiIndex DataFrame 생성
health_data = pd.DataFrame(data, index=index, columns=columns)

health_data  # DataFrame 출력

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2014 1      47.0  37.3  53.0  36.0  39.0  37.3
     2      62.0  35.9  39.0  38.1  52.0  36.2
     1      21.0  38.1  37.0  36.7  49.0  36.7
     2      19.0  37.0  38.0  35.9  29.0  38.6

In [26]:
health_data['Guido']  # 'Guido'의 HR과 Temp 데이터 선택

type          HR  Temp
year visit
2014 1      53.0  36.0
     2      39.0  38.1
     1      37.0  36.7
     2      38.0  35.9

In [27]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [28]:
pop['California', 2000]

33871648

In [29]:
pop['California']

year
2000    33871648
2010    37253956
dtype: int64

In [30]:
pop.loc['California':'New York']  # 'California'부터 'New York'까지의 데이터 선택

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [31]:
pop[:, 2000]  # 모든 주(:)의 2000년 데이터 선택

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [32]:
pop[pop > 22000000]  # 2200만 이상 인구를 가진 주/연도 선택

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [33]:
pop[['California', 'Texas']]  # California와 Texas의 모든 연도 데이터 선택, 팬시 인덱싱 사용

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

In [34]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2014 1      47.0  37.3  53.0  36.0  39.0  37.3
     2      62.0  35.9  39.0  38.1  52.0  36.2
     1      21.0  38.1  37.0  36.7  49.0  36.7
     2      19.0  37.0  38.0  35.9  29.0  38.6

In [35]:
health_data['Guido', 'HR']

year  visit
2014  1        53.0
      2        39.0
      1        37.0
      2        38.0
Name: (Guido, HR), dtype: float64

In [36]:
health_data.iloc[:2, :2]  # 처음 2행(2014년 방문1,2), 처음 2열(Bob의 HR,Temp) 선택

subject      Bob
type          HR  Temp
year visit
2014 1      47.0  37.3
     2      62.0  35.9

In [37]:
health_data.loc[:, ('Bob', 'HR')]  # Bob의 HR 데이터만 선택

year  visit
2014  1        47.0
      2        62.0
      1        21.0
      2        19.0
Name: (Bob, HR), dtype: float64

In [38]:
health_data.loc[(:, 1), (:, 'HR')]

SyntaxError: invalid syntax (3311942670.py, line 1)

In [39]:
idx = pd.IndexSlice
health_data.loc[idx[:, 1], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2014 1      47.0  53.0  39.0
     1      21.0  37.0  49.0

In [40]:
# 계층적 인덱스 생성
index = pd.MultiIndex.from_product([['a', 'c', 'b'], [1, 2]])  # 두 리스트의 카테시안 곱

# 랜덤 데이터로 Series 생성
data = pd.Series(np.random.rand(6), index=index)  # 6개의 랜덤 값

# 인덱스 레벨 이름 지정
data.index.names = ['char', 'int']  # 첫 번째 레벨: char, 두 번째 레벨: int

data  # Series 출력

char  int
a     1      0.693994
      2      0.289831
c     1      0.961106
      2      0.613701
b     1      0.201263
      2      0.477591
dtype: float64

In [41]:
try:
    data['a':'b']  # 'a'부터 'b'까지 슬라이싱 시도
except KeyError as e:
    print(type(e))  # 에러 타입 출력
    print(e)        # 에러 메시지 출력

<class 'pandas.errors.UnsortedIndexError'>
'Key length (1) was greater than MultiIndex lexsort depth (0)'

In [42]:
# 정렬된 새로운 Series 생성
data = data.sort_index()  # MultiIndex 기준으로 정렬
data  # 정렬된 Series 출력

char  int
a     1      0.693994
      2      0.289831
b     1      0.201263
      2      0.477591
c     1      0.961106
      2      0.613701
dtype: float64

In [43]:
data['a':'b']

char  int
a     1      0.693994
      2      0.289831
b     1      0.201263
      2      0.477591
dtype: float64

In [44]:
pop.unstack(level=0)  # state 레벨을 열로 변환

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [45]:
pop.unstack(level=1)  # year 레벨을 열로 변환

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [46]:
pop.unstack().stack()  # DataFrame으로 변환 후 다시 Series로 변환

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [47]:
pop_flat = pop.reset_index(name='population')  # MultiIndex를 일반 열로 변환
pop_flat  # 변환된 DataFrame 출력

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [48]:
pop_flat.set_index(['state', 'year'])  # state와 year를 MultiIndex로 설정

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561